maxboss10086/max_dsp/max/F28388D/10_endat_clk/device/driverlib/pin_map.h
#define GPIO_10_GPIO10                   0x00061400U
#define GPIO_10_EPWM6A                   0x00061401U
#define GPIO_10_CANRXB                   0x00061402U
#define GPIO_10_ADCSOCBO                 0x00061403U
#define GPIO_10_EQEP1A                   0x00061405U
#define GPIO_10_SCITXDB                  0x00061406U
#define GPIO_10_MCANRXA                  0x00061409U
#define GPIO_10_ECAT_GPO2                0x0006140AU
#define GPIO_10_FSIRXD1B                 0x0006140DU
#define GPIO_10_FSITXCLKA                0x0006140EU
#define GPIO_10_FSIRXD1A                 0x0006140FU

#define GPIO_11_GPIO11                   0x00061600U
#define GPIO_11_EPWM6B                   0x00061601U
#define GPIO_11_SCIRXDB                  0x00061602U
#define GPIO_11_OUTPUTXBAR7              0x00061603U
#define GPIO_11_EQEP1B                   0x00061605U
#define GPIO_11_ECAT_GPO3                0x0006160AU
#define GPIO_11_FSIRXCLKB                0x0006160DU
#define GPIO_11_FSIRXD1A                 0x0006160EU

#define GPIO_12_GPIO12                   0x00061800U
#define GPIO_12_EPWM7A                   0x00061801U
#define GPIO_12_CANTXB                   0x00061802U
#define GPIO_12_MDXB                     0x00061803U
#define GPIO_12_EQEP1S                   0x00061805U
#define GPIO_12_SCITXDC                  0x00061806U
#define GPIO_12_ECAT_GPO4                0x0006180AU
#define GPIO_12_FSIRXD0C                 0x0006180DU
#define GPIO_12_FSIRXD0A                 0x0006180EU

#define GPIO_13_GPIO13                   0x00061A00U
#define GPIO_13_EPWM7B                   0x00061A01U
#define GPIO_13_CANRXB                   0x00061A02U
#define GPIO_13_MDRB                     0x00061A03U
#define GPIO_13_EQEP1I                   0x00061A05U
#define GPIO_13_SCIRXDC                  0x00061A06U
#define GPIO_13_ECAT_GPO5                0x00061A0AU
#define GPIO_13_FSIRXD1C                 0x00061A0DU
#define GPIO_13_FSIRXCLKA                0x00061A0EU

#define GPIO_14_GPIO14                   0x00061C00U
#define GPIO_14_EPWM8A                   0x00061C01U
#define GPIO_14_SCITXDB                  0x00061C02U
#define GPIO_14_MCLKXB                   0x00061C03U
#define GPIO_14_OUTPUTXBAR3              0x00061C06U
#define GPIO_14_ECAT_GPO6                0x00061C0AU
#define GPIO_14_FSIRXCLKC                0x00061C0DU

#define GPIO_15_GPIO15                   0x00061E00U
#define GPIO_15_EPWM8B                   0x00061E01U
#define GPIO_15_SCIRXDB                  0x00061E02U
#define GPIO_15_MFSXB                    0x00061E03U
#define GPIO_15_OUTPUTXBAR4              0x00061E06U
#define GPIO_15_ECAT_GPO7                0x00061E0AU
#define GPIO_15_FSIRXD0D                 0x00061E0DU

#define GPIO_16_GPIO16                   0x00080000U
#define GPIO_16_SPISIMOA                 0x00080001U
#define GPIO_16_CANTXB                   0x00080002U
#define GPIO_16_OUTPUTXBAR7              0x00080003U
#define GPIO_16_EPWM9A                   0x00080005U
#define GPIO_16_SD_D1                    0x00080007U
#define GPIO_16_CMSSITXA                 0x0008000BU
#define GPIO_16_FSIRXD1D                 0x0008000DU

#define GPIO_17_GPIO17                   0x00080200U
#define GPIO_17_SPISOMIA                 0x00080201U
#define GPIO_17_CANRXB                   0x00080202U
#define GPIO_17_OUTPUTXBAR8              0x00080203U
#define GPIO_17_EPWM9B                   0x00080205U
#define GPIO_17_SD_C1                    0x00080207U
#define GPIO_17_CMSSIRXA                 0x0008020BU
#define GPIO_17_FSIRXCLKD                0x0008020DU

#define GPIO_18_GPIO18                   0x00080400U
#define GPIO_18_SPICLKA                  0x00080401U
#define GPIO_18_SCITXDB                  0x00080402U
#define GPIO_18_CANRXA                   0x00080403U
#define GPIO_18_EPWM10A                  0x00080405U
#define GPIO_18_SD_D2                    0x00080407U
#define GPIO_18_MCANRXA                  0x00080409U
#define GPIO_18_EM1CS2N                  0x0008040AU
#define GPIO_18_CMSSICLKA                0x0008040BU
#define GPIO_18_FSIRXD0E                 0x0008040DU

#define GPIO_19_GPIO19                   0x00080600U
#define GPIO_19_SPISTEA                  0x00080601U
#define GPIO_19_SCIRXDB                  0x00080602U
#define GPIO_19_CANTXA                   0x00080603U
#define GPIO_19_EPWM10B                  0x00080605U
#define GPIO_19_SD_C2                    0x00080607U
#define GPIO_19_MCANTXA                  0x00080609U
#define GPIO_19_EM1CS3N                  0x0008060AU
#define GPIO_19_CMSSIFSSA                0x0008060BU
#define GPIO_19_FSIRXD1E                 0x0008060DU

#define GPIO_20_GPIO20                   0x00080800U
#define GPIO_20_EQEP1A                   0x00080801U
#define GPIO_20_MDXA                     0x00080802U
#define GPIO_20_CANTXB                   0x00080803U
#define GPIO_20_EPWM11A                  0x00080805U
#define GPIO_20_SD_D3                    0x00080807U
#define GPIO_20_EM1BA0                   0x0008080AU
#define GPIO_20_TRACEDATA0               0x0008080BU
#define GPIO_20_FSIRXCLKE                0x0008080DU
#define GPIO_20_SPISIMOC                 0x0008080EU

#define GPIO_21_GPIO21                   0x00080A00U
#define GPIO_21_EQEP1B                   0x00080A01U
#define GPIO_21_MDRA                     0x00080A02U
#define GPIO_21_CANRXB                   0x00080A03U
#define GPIO_21_EPWM11B                  0x00080A05U
#define GPIO_21_SD_C3                    0x00080A07U
#define GPIO_21_EM1BA1                   0x00080A0AU
#define GPIO_21_TRACEDATA1               0x00080A0BU
#define GPIO_21_FSIRXD0F                 0x00080A0DU
#define GPIO_21_SPISOMIC                 0x00080A0EU

#define GPIO_22_GPIO22                   0x00080C00U
#define GPIO_22_EQEP1S                   0x00080C01U
#define GPIO_22_MCLKXA                   0x00080C02U
#define GPIO_22_SCITXDB                  0x00080C03U
#define GPIO_22_EPWM12A                  0x00080C05U
#define GPIO_22_SPICLKB                  0x00080C06U
#define GPIO_22_SD_D4                    0x00080C07U
#define GPIO_22_MCANTXA                  0x00080C09U
#define GPIO_22_EM1RAS                   0x00080C0AU
#define GPIO_22_TRACEDATA2               0x00080C0BU
#define GPIO_22_FSIRXD1F                 0x00080C0DU
#define GPIO_22_SPICLKC                  0x00080C0EU

#define GPIO_23_GPIO23                   0x00080E00U
#define GPIO_23_EQEP1I                   0x00080E01U
#define GPIO_23_MFSXA                    0x00080E02U
#define GPIO_23_SCIRXDB                  0x00080E03U
#define GPIO_23_EPWM12B                  0x00080E05U
#define GPIO_23_SPISTEB                  0x00080E06U
#define GPIO_23_SD_C4                    0x00080E07U
#define GPIO_23_MCANRXA                  0x00080E09U
#define GPIO_23_EM1CAS                   0x00080E0AU
#define GPIO_23_TRACEDATA3               0x00080E0BU
#define GPIO_23_FSIRXCLKF                0x00080E0DU
#define GPIO_23_SPISTEC                  0x00080E0EU

