maxboss10086/max_dsp/max/F28388D/10_endat_clk/device/driverlib/pin_map.h
#define GPIO_24_GPIO24                   0x00081000U
#define GPIO_24_OUTPUTXBAR1              0x00081001U
#define GPIO_24_EQEP2A                   0x00081002U
#define GPIO_24_MDXB                     0x00081003U
#define GPIO_24_SPISIMOB                 0x00081006U
#define GPIO_24_SD_D5                    0x00081007U
#define GPIO_24_PMBCLK                   0x00081009U
#define GPIO_24_EM1DQM0                  0x0008100AU
#define GPIO_24_TRACECLK                 0x0008100BU
#define GPIO_24_EPWM13A                  0x0008100DU
#define GPIO_24_FSIRXD0G                 0x0008100FU

#define GPIO_25_GPIO25                   0x00081200U
#define GPIO_25_OUTPUTXBAR2              0x00081201U
#define GPIO_25_EQEP2B                   0x00081202U
#define GPIO_25_MDRB                     0x00081203U
#define GPIO_25_SPISOMIB                 0x00081206U
#define GPIO_25_SD_C5                    0x00081207U
#define GPIO_25_PMBDAT                   0x00081209U
#define GPIO_25_EM1DQM1                  0x0008120AU
#define GPIO_25_TRACESWO                 0x0008120BU
#define GPIO_25_EPWM13B                  0x0008120DU
#define GPIO_25_FSITXD1A                 0x0008120EU
#define GPIO_25_FSIRXD1G                 0x0008120FU

#define GPIO_26_GPIO26                   0x00081400U
#define GPIO_26_OUTPUTXBAR3              0x00081401U
#define GPIO_26_EQEP2I                   0x00081402U
#define GPIO_26_MCLKXB                   0x00081403U
#define GPIO_26_SPICLKB                  0x00081406U
#define GPIO_26_SD_D6                    0x00081407U
#define GPIO_26_PMBALERT                 0x00081409U
#define GPIO_26_EM1DQM2                  0x0008140AU
#define GPIO_26_ECAT_MDIO_CLK            0x0008140BU
#define GPIO_26_EPWM14A                  0x0008140DU
#define GPIO_26_FSITXD0A                 0x0008140EU
#define GPIO_26_FSIRXCLKG                0x0008140FU

#define GPIO_27_GPIO27                   0x00081600U
#define GPIO_27_OUTPUTXBAR4              0x00081601U
#define GPIO_27_EQEP2S                   0x00081602U
#define GPIO_27_MFSXB                    0x00081603U
#define GPIO_27_SPISTEB                  0x00081606U
#define GPIO_27_SD_C6                    0x00081607U
#define GPIO_27_PMBCTRL                  0x00081609U
#define GPIO_27_EM1DQM3                  0x0008160AU
#define GPIO_27_ECAT_MDIO_DATA           0x0008160BU
#define GPIO_27_EPWM14B                  0x0008160DU
#define GPIO_27_FSITXCLKA                0x0008160EU
#define GPIO_27_FSIRXD0H                 0x0008160FU

#define GPIO_28_GPIO28                   0x00081800U
#define GPIO_28_SCIRXDA                  0x00081801U
#define GPIO_28_EM1CS4N                  0x00081802U
#define GPIO_28_OUTPUTXBAR5              0x00081805U
#define GPIO_28_EQEP3A                   0x00081806U
#define GPIO_28_SD_D7                    0x00081807U
#define GPIO_28_EM1CS2N                  0x00081809U
#define GPIO_28_EPWM15A                  0x0008180DU
#define GPIO_28_FSIRXD1H                 0x0008180FU

#define GPIO_29_GPIO29                   0x00081A00U
#define GPIO_29_SCITXDA                  0x00081A01U
#define GPIO_29_EM1SDCKE                 0x00081A02U
#define GPIO_29_OUTPUTXBAR6              0x00081A05U
#define GPIO_29_EQEP3B                   0x00081A06U
#define GPIO_29_SD_C7                    0x00081A07U
#define GPIO_29_EM1CS3N                  0x00081A09U
#define GPIO_29_ECAT_LATCH0              0x00081A0AU
#define GPIO_29_ECAT_I2C_SDA             0x00081A0BU
#define GPIO_29_EPWM15B                  0x00081A0DU
#define GPIO_29_ECAT_SYNC0               0x00081A0EU
#define GPIO_29_FSIRXCLKH                0x00081A0FU

#define GPIO_30_GPIO30                   0x00081C00U
#define GPIO_30_CANRXA                   0x00081C01U
#define GPIO_30_EM1CLK                   0x00081C02U
#define GPIO_30_MCANRXA                  0x00081C03U
#define GPIO_30_OUTPUTXBAR7              0x00081C05U
#define GPIO_30_EQEP3S                   0x00081C06U
#define GPIO_30_SD_D8                    0x00081C07U
#define GPIO_30_EM1CS4N                  0x00081C09U
#define GPIO_30_ECAT_LATCH1              0x00081C0AU
#define GPIO_30_ECAT_I2C_SCL             0x00081C0BU
#define GPIO_30_EPWM16A                  0x00081C0DU
#define GPIO_30_ECAT_SYNC1               0x00081C0EU
#define GPIO_30_SPISIMOD                 0x00081C0FU

#define GPIO_31_GPIO31                   0x00081E00U
#define GPIO_31_CANTXA                   0x00081E01U
#define GPIO_31_EM1WEN                   0x00081E02U
#define GPIO_31_MCANTXA                  0x00081E03U
#define GPIO_31_OUTPUTXBAR8              0x00081E05U
#define GPIO_31_EQEP3I                   0x00081E06U
#define GPIO_31_SD_C8                    0x00081E07U
#define GPIO_31_EM1RNW                   0x00081E09U
#define GPIO_31_SDAA                     0x00081E0AU
#define GPIO_31_CMI2CSDAA                0x00081E0BU
#define GPIO_31_EPWM16B                  0x00081E0DU
#define GPIO_31_SPISOMID                 0x00081E0FU

#define GPIO_32_GPIO32                   0x00460000U
#define GPIO_32_SDAA                     0x00460001U
#define GPIO_32_EM1CS0N                  0x00460002U
#define GPIO_32_SPISIMOA                 0x00460003U
#define GPIO_32_EM1OEN                   0x00460009U
#define GPIO_32_SCLA                     0x0046000AU
#define GPIO_32_CMI2CSCLA                0x0046000BU
#define GPIO_32_SPICLKD                  0x0046000FU

#define GPIO_33_GPIO33                   0x00460200U
#define GPIO_33_SCLA                     0x00460201U
#define GPIO_33_EM1RNW                   0x00460202U
#define GPIO_33_SPISOMIA                 0x00460203U
#define GPIO_33_EM1BA0                   0x00460209U
#define GPIO_33_SPISTED                  0x0046020FU

#define GPIO_34_GPIO34                   0x00460400U
#define GPIO_34_OUTPUTXBAR1              0x00460401U
#define GPIO_34_EM1CS2N                  0x00460402U
#define GPIO_34_SPICLKA                  0x00460403U
#define GPIO_34_SDAB                     0x00460406U
#define GPIO_34_EM1BA1                   0x00460409U
#define GPIO_34_ECAT_LATCH0              0x0046040AU
#define GPIO_34_ENET_MII_CRS             0x0046040BU
#define GPIO_34_SCITXDA                  0x0046040DU
#define GPIO_34_ECAT_SYNC0               0x0046040EU
#define GPIO_34_OFSD_2_N                 0x0046040FU

#define GPIO_35_GPIO35                   0x00460600U
#define GPIO_35_SCIRXDA                  0x00460601U
#define GPIO_35_EM1CS3N                  0x00460602U
#define GPIO_35_SPISTEA                  0x00460603U
#define GPIO_35_SCLB                     0x00460606U
#define GPIO_35_EM1A0                    0x00460609U
#define GPIO_35_ECAT_LATCH1              0x0046060AU
#define GPIO_35_ENET_MII_COL             0x0046060BU
#define GPIO_35_ECAT_SYNC1               0x0046060EU
#define GPIO_35_IID                      0x0046060FU

