maxboss10086/max_dsp/max/F28388D/10_endat_clk/device/driverlib/pin_map.h
#define GPIO_36_GPIO36                   0x00460800U
#define GPIO_36_SCITXDA                  0x00460801U
#define GPIO_36_EM1WAIT0                 0x00460802U
#define GPIO_36_CANRXA                   0x00460806U
#define GPIO_36_EM1A1                    0x00460809U
#define GPIO_36_MCANRXA                  0x0046080AU
#define GPIO_36_SD_D1                    0x0046080DU
#define GPIO_36_ISESSEND                 0x0046080FU

#define GPIO_37_GPIO37                   0x00460A00U
#define GPIO_37_OUTPUTXBAR2              0x00460A01U
#define GPIO_37_EM1OEN                   0x00460A02U
#define GPIO_37_CANTXA                   0x00460A06U
#define GPIO_37_EM1A2                    0x00460A09U
#define GPIO_37_MCANTXA                  0x00460A0AU
#define GPIO_37_SD_D2                    0x00460A0DU
#define GPIO_37_IAVALID                  0x00460A0FU

#define GPIO_38_GPIO38                   0x00460C00U
#define GPIO_38_EM1A0                    0x00460C02U
#define GPIO_38_SCITXDC                  0x00460C05U
#define GPIO_38_CANTXB                   0x00460C06U
#define GPIO_38_EM1A3                    0x00460C09U
#define GPIO_38_ENET_MII_RX_DV           0x00460C0AU
#define GPIO_38_ENET_MII_CRS             0x00460C0BU
#define GPIO_38_SD_D3                    0x00460C0DU

#define GPIO_39_GPIO39                   0x00460E00U
#define GPIO_39_EM1A1                    0x00460E02U
#define GPIO_39_SCIRXDC                  0x00460E05U
#define GPIO_39_CANRXB                   0x00460E06U
#define GPIO_39_EM1A4                    0x00460E09U
#define GPIO_39_ENET_MII_RX_ERR          0x00460E0AU
#define GPIO_39_ENET_MII_COL             0x00460E0BU
#define GPIO_39_SD_D4                    0x00460E0DU

#define GPIO_40_GPIO40                   0x00461000U
#define GPIO_40_EM1A2                    0x00461002U
#define GPIO_40_SDAB                     0x00461006U
#define GPIO_40_ENET_MII_CRS             0x0046100BU
#define GPIO_40_ECAT_I2C_SDA             0x0046100EU

#define GPIO_41_GPIO41                   0x00461200U
#define GPIO_41_EM1A3                    0x00461202U
#define GPIO_41_EMU1                     0x00461203U
#define GPIO_41_SCLB                     0x00461206U
#define GPIO_41_ENET_REVMII_MDIO_RST     0x0046120AU
#define GPIO_41_ENET_MII_COL             0x0046120BU
#define GPIO_41_ECAT_I2C_SCL             0x0046120EU

#define GPIO_42_GPIO42                   0x00461400U
#define GPIO_42_SDAA                     0x00461406U
#define GPIO_42_ENET_MDIO_CLK            0x0046140AU
#define GPIO_42_CMUARTTXA                0x0046140BU
#define GPIO_42_SCITXDA                  0x0046140FU

#define GPIO_43_GPIO43                   0x00461600U
#define GPIO_43_SCLA                     0x00461606U
#define GPIO_43_ENET_MDIO_DATA           0x0046160AU
#define GPIO_43_CMUARTRXA                0x0046160BU
#define GPIO_43_SCIRXDA                  0x0046160FU

#define GPIO_44_GPIO44                   0x00461800U
#define GPIO_44_EM1A4                    0x00461802U
#define GPIO_44_ENET_MII_TX_CLK          0x0046180BU
#define GPIO_44_ECAT_TX1_CLK             0x0046180EU
#define GPIO_44_IXRCV                    0x0046180FU

#define GPIO_45_GPIO45                   0x00461A00U
#define GPIO_45_EM1A5                    0x00461A02U
#define GPIO_45_ENET_MII_TX_EN           0x00461A0BU
#define GPIO_45_ECAT_TX1_ENA             0x00461A0EU
#define GPIO_45_IDM                      0x00461A0FU

#define GPIO_46_GPIO46                   0x00461C00U
#define GPIO_46_EM1A6                    0x00461C02U
#define GPIO_46_SCIRXDD                  0x00461C06U
#define GPIO_46_ENET_MII_TX_ERR          0x00461C0BU
#define GPIO_46_ECAT_MDIO_CLK            0x00461C0EU
#define GPIO_46_IDP                      0x00461C0FU

#define GPIO_47_GPIO47                   0x00461E00U
#define GPIO_47_EM1A7                    0x00461E02U
#define GPIO_47_SCITXDD                  0x00461E06U
#define GPIO_47_ENET_PPS0                0x00461E0BU
#define GPIO_47_ECAT_MDIO_DATA           0x00461E0EU
#define GPIO_47_OFSD_1_N                 0x00461E0FU

#define GPIO_48_GPIO48                   0x00480000U
#define GPIO_48_OUTPUTXBAR3              0x00480001U
#define GPIO_48_EM1A8                    0x00480002U
#define GPIO_48_SCITXDA                  0x00480006U
#define GPIO_48_SD_D1                    0x00480007U
#define GPIO_48_ENET_PPS1                0x0048000BU
#define GPIO_48_ECAT_PHY_CLK             0x0048000EU

#define GPIO_49_GPIO49                   0x00480200U
#define GPIO_49_OUTPUTXBAR4              0x00480201U
#define GPIO_49_EM1A9                    0x00480202U
#define GPIO_49_SCIRXDA                  0x00480206U
#define GPIO_49_SD_C1                    0x00480207U
#define GPIO_49_EM1A5                    0x00480209U
#define GPIO_49_ENET_MII_RX_CLK          0x0048020BU
#define GPIO_49_SD_D5                    0x0048020DU
#define GPIO_49_FSITXD0A                 0x0048020EU

#define GPIO_50_GPIO50                   0x00480400U
#define GPIO_50_EQEP1A                   0x00480401U
#define GPIO_50_EM1A10                   0x00480402U
#define GPIO_50_SPISIMOC                 0x00480406U
#define GPIO_50_SD_D2                    0x00480407U
#define GPIO_50_EM1A6                    0x00480409U
#define GPIO_50_ENET_MII_RX_DV           0x0048040BU
#define GPIO_50_SD_D6                    0x0048040DU
#define GPIO_50_FSITXD1A                 0x0048040EU

#define GPIO_51_GPIO51                   0x00480600U
#define GPIO_51_EQEP1B                   0x00480601U
#define GPIO_51_EM1A11                   0x00480602U
#define GPIO_51_SPISOMIC                 0x00480606U
#define GPIO_51_SD_C2                    0x00480607U
#define GPIO_51_EM1A7                    0x00480609U
#define GPIO_51_ENET_MII_RX_ERR          0x0048060BU
#define GPIO_51_SD_D7                    0x0048060DU
#define GPIO_51_FSITXCLKA                0x0048060EU

#define GPIO_52_GPIO52                   0x00480800U
#define GPIO_52_EQEP1S                   0x00480801U
#define GPIO_52_EM1A12                   0x00480802U
#define GPIO_52_SPICLKC                  0x00480806U
#define GPIO_52_SD_D3                    0x00480807U
#define GPIO_52_EM1A8                    0x00480809U
#define GPIO_52_ENET_MII_RX_DATA0        0x0048080BU
#define GPIO_52_SD_D8                    0x0048080DU
#define GPIO_52_FSIRXD0A                 0x0048080EU

#define GPIO_53_GPIO53                   0x00480A00U
#define GPIO_53_EQEP1I                   0x00480A01U
#define GPIO_53_EM1D31                   0x00480A02U
#define GPIO_53_EM2D15                   0x00480A03U
#define GPIO_53_SPISTEC                  0x00480A06U
#define GPIO_53_SD_C3                    0x00480A07U
#define GPIO_53_EM1A9                    0x00480A09U
#define GPIO_53_ENET_MII_RX_DATA1        0x00480A0BU
#define GPIO_53_SD_C1                    0x00480A0DU
#define GPIO_53_FSIRXD1A                 0x00480A0EU

#define GPIO_54_GPIO54                   0x00480C00U
#define GPIO_54_SPISIMOA                 0x00480C01U
#define GPIO_54_EM1D30                   0x00480C02U
#define GPIO_54_EM2D14                   0x00480C03U
#define GPIO_54_EQEP2A                   0x00480C05U
#define GPIO_54_SCITXDB                  0x00480C06U
#define GPIO_54_SD_D4                    0x00480C07U
#define GPIO_54_EM1A10                   0x00480C09U
#define GPIO_54_ENET_MII_RX_DATA2        0x00480C0BU
#define GPIO_54_SD_C2                    0x00480C0DU
#define GPIO_54_FSIRXCLKA                0x00480C0EU
#define GPIO_54_CMSSITXA                 0x00480C0FU

#define GPIO_55_GPIO55                   0x00480E00U
#define GPIO_55_SPISOMIA                 0x00480E01U
#define GPIO_55_EM1D29                   0x00480E02U
#define GPIO_55_EM2D13                   0x00480E03U
#define GPIO_55_EQEP2B                   0x00480E05U
#define GPIO_55_SCIRXDB                  0x00480E06U
#define GPIO_55_SD_C4                    0x00480E07U
#define GPIO_55_EM1D0                    0x00480E09U
#define GPIO_55_ENET_MII_RX_DATA3        0x00480E0BU
#define GPIO_55_SD_C3                    0x00480E0DU
#define GPIO_55_FSITXD0B                 0x00480E0EU
#define GPIO_55_CMSSIRXA                 0x00480E0FU

#define GPIO_56_GPIO56                   0x00481000U
#define GPIO_56_SPICLKA                  0x00481001U
#define GPIO_56_EM1D28                   0x00481002U
#define GPIO_56_EM2D12                   0x00481003U
#define GPIO_56_EQEP2S                   0x00481005U
#define GPIO_56_SCITXDC                  0x00481006U
#define GPIO_56_SD_D5                    0x00481007U
#define GPIO_56_EM1D1                    0x00481009U
#define GPIO_56_SDAA                     0x0048100AU
#define GPIO_56_ENET_MII_TX_EN           0x0048100BU
#define GPIO_56_SD_C4                    0x0048100DU
#define GPIO_56_FSITXCLKB                0x0048100EU
#define GPIO_56_CMSSICLKA                0x0048100FU

#define GPIO_57_GPIO57                   0x00481200U
#define GPIO_57_SPISTEA                  0x00481201U
#define GPIO_57_EM1D27                   0x00481202U
#define GPIO_57_EM2D11                   0x00481203U
#define GPIO_57_EQEP2I                   0x00481205U
#define GPIO_57_SCIRXDC                  0x00481206U
#define GPIO_57_SD_C5                    0x00481207U
#define GPIO_57_EM1D2                    0x00481209U
#define GPIO_57_SCLA                     0x0048120AU
#define GPIO_57_ENET_MII_TX_ERR          0x0048120BU
#define GPIO_57_FSITXD1B                 0x0048120EU
#define GPIO_57_CMSSIFSSA                0x0048120FU

#define GPIO_58_GPIO58                   0x00481400U
#define GPIO_58_MCLKRA                   0x00481401U
#define GPIO_58_EM1D26                   0x00481402U
#define GPIO_58_EM2D10                   0x00481403U
#define GPIO_58_OUTPUTXBAR1              0x00481405U
#define GPIO_58_SPICLKB                  0x00481406U
#define GPIO_58_SD_D6                    0x00481407U
#define GPIO_58_EM1D3                    0x00481409U
#define GPIO_58_ECAT_LED_LINK0_ACTIVE    0x0048140AU
#define GPIO_58_ENET_MII_TX_CLK          0x0048140BU
#define GPIO_58_SD_C6                    0x0048140DU
#define GPIO_58_FSIRXD0B                 0x0048140EU
#define GPIO_58_SPISIMOA                 0x0048140FU

#define GPIO_59_GPIO59                   0x00481600U
#define GPIO_59_MFSRA                    0x00481601U
#define GPIO_59_EM1D25                   0x00481602U
#define GPIO_59_EM2D9                    0x00481603U
#define GPIO_59_OUTPUTXBAR2              0x00481605U
#define GPIO_59_SPISTEB                  0x00481606U
#define GPIO_59_SD_C6                    0x00481607U
#define GPIO_59_EM1D4                    0x00481609U
#define GPIO_59_ECAT_LED_LINK1_ACTIVE    0x0048160AU
#define GPIO_59_ENET_MII_TX_DATA0        0x0048160BU
#define GPIO_59_SD_C7                    0x0048160DU
#define GPIO_59_FSIRXD1B                 0x0048160EU
#define GPIO_59_SPISOMIA                 0x0048160FU

