maxboss10086/max_dsp/max/F28388D/10_endat_clk/device/driverlib/pin_map.h
#define GPIO_60_GPIO60                   0x00481800U
#define GPIO_60_MCLKRB                   0x00481801U
#define GPIO_60_EM1D24                   0x00481802U
#define GPIO_60_EM2D8                    0x00481803U
#define GPIO_60_OUTPUTXBAR3              0x00481805U
#define GPIO_60_SPISIMOB                 0x00481806U
#define GPIO_60_SD_D7                    0x00481807U
#define GPIO_60_EM1D5                    0x00481809U
#define GPIO_60_ECAT_LED_ERR             0x0048180AU
#define GPIO_60_ENET_MII_TX_DATA1        0x0048180BU
#define GPIO_60_SD_C8                    0x0048180DU
#define GPIO_60_FSIRXCLKB                0x0048180EU
#define GPIO_60_SPICLKA                  0x0048180FU

#define GPIO_61_GPIO61                   0x00481A00U
#define GPIO_61_MFSRB                    0x00481A01U
#define GPIO_61_EM1D23                   0x00481A02U
#define GPIO_61_EM2D7                    0x00481A03U
#define GPIO_61_OUTPUTXBAR4              0x00481A05U
#define GPIO_61_SPISOMIB                 0x00481A06U
#define GPIO_61_SD_C7                    0x00481A07U
#define GPIO_61_EM1D6                    0x00481A09U
#define GPIO_61_ECAT_LED_RUN             0x00481A0AU
#define GPIO_61_ENET_MII_TX_DATA2        0x00481A0BU
#define GPIO_61_CANRXA                   0x00481A0EU
#define GPIO_61_SPISTEA                  0x00481A0FU

#define GPIO_62_GPIO62                   0x00481C00U
#define GPIO_62_SCIRXDC                  0x00481C01U
#define GPIO_62_EM1D22                   0x00481C02U
#define GPIO_62_EM2D6                    0x00481C03U
#define GPIO_62_EQEP3A                   0x00481C05U
#define GPIO_62_CANRXA                   0x00481C06U
#define GPIO_62_SD_D8                    0x00481C07U
#define GPIO_62_EM1D7                    0x00481C09U
#define GPIO_62_ECAT_LED_STATE_RUN       0x00481C0AU
#define GPIO_62_ENET_MII_TX_DATA3        0x00481C0BU
#define GPIO_62_CANTXA                   0x00481C0EU

#define GPIO_63_GPIO63                   0x00481E00U
#define GPIO_63_SCITXDC                  0x00481E01U
#define GPIO_63_EM1D21                   0x00481E02U
#define GPIO_63_EM2D5                    0x00481E03U
#define GPIO_63_EQEP3B                   0x00481E05U
#define GPIO_63_CANTXA                   0x00481E06U
#define GPIO_63_SD_C8                    0x00481E07U
#define GPIO_63_CMSSITXA                 0x00481E09U
#define GPIO_63_ENET_MII_RX_DATA0        0x00481E0BU
#define GPIO_63_SD_D1                    0x00481E0DU
#define GPIO_63_ECAT_RX1_DATA0           0x00481E0EU
#define GPIO_63_SPISIMOB                 0x00481E0FU

#define GPIO_64_GPIO64                   0x00860000U
#define GPIO_64_EM1D20                   0x00860002U
#define GPIO_64_EM2D4                    0x00860003U
#define GPIO_64_EQEP3S                   0x00860005U
#define GPIO_64_SCIRXDA                  0x00860006U
#define GPIO_64_CMSSIRXA                 0x00860009U
#define GPIO_64_ENET_MII_RX_DV           0x0086000AU
#define GPIO_64_ENET_MII_RX_DATA1        0x0086000BU
#define GPIO_64_SD_C1                    0x0086000DU
#define GPIO_64_ECAT_RX1_DATA1           0x0086000EU
#define GPIO_64_SPISOMIB                 0x0086000FU

#define GPIO_65_GPIO65                   0x00860200U
#define GPIO_65_EM1D19                   0x00860202U
#define GPIO_65_EM2D3                    0x00860203U
#define GPIO_65_EQEP3I                   0x00860205U
#define GPIO_65_SCITXDA                  0x00860206U
#define GPIO_65_CMSSICLKA                0x00860209U
#define GPIO_65_ENET_MII_RX_ERR          0x0086020AU
#define GPIO_65_ENET_MII_RX_DATA2        0x0086020BU
#define GPIO_65_SD_D2                    0x0086020DU
#define GPIO_65_ECAT_RX1_DATA2           0x0086020EU
#define GPIO_65_SPICLKB                  0x0086020FU

#define GPIO_66_GPIO66                   0x00860400U
#define GPIO_66_EM1D18                   0x00860402U
#define GPIO_66_EM2D2                    0x00860403U
#define GPIO_66_SDAB                     0x00860406U
#define GPIO_66_CMSSIFSSA                0x00860409U
#define GPIO_66_ENET_MII_RX_DATA0        0x0086040AU
#define GPIO_66_ENET_MII_RX_DATA3        0x0086040BU
#define GPIO_66_SD_C2                    0x0086040DU
#define GPIO_66_ECAT_RX1_DATA3           0x0086040EU
#define GPIO_66_SPISTEB                  0x0086040FU

#define GPIO_67_GPIO67                   0x00860600U
#define GPIO_67_EM1D17                   0x00860602U
#define GPIO_67_EM2D1                    0x00860603U
#define GPIO_67_ENET_MII_RX_CLK          0x0086060AU
#define GPIO_67_ENET_REVMII_MDIO_RST     0x0086060BU
#define GPIO_67_SD_D3                    0x0086060DU

#define GPIO_68_GPIO68                   0x00860800U
#define GPIO_68_EM1D16                   0x00860802U
#define GPIO_68_EM2D0                    0x00860803U
#define GPIO_68_ENET_MII_INTR            0x0086080BU
#define GPIO_68_SD_C3                    0x0086080DU
#define GPIO_68_ECAT_PHY1_LINKSTATUS     0x0086080EU

#define GPIO_69_GPIO69                   0x00860A00U
#define GPIO_69_EM1D15                   0x00860A02U
#define GPIO_69_EMU0                     0x00860A03U
#define GPIO_69_SCLB                     0x00860A06U
#define GPIO_69_ENET_MII_TX_EN           0x00860A0AU
#define GPIO_69_ENET_MII_RX_CLK          0x00860A0BU
#define GPIO_69_SD_D4                    0x00860A0DU
#define GPIO_69_ECAT_RX1_CLK             0x00860A0EU
#define GPIO_69_SPISIMOC                 0x00860A0FU

#define GPIO_70_GPIO70                   0x00860C00U
#define GPIO_70_EM1D14                   0x00860C02U
#define GPIO_70_EMU0                     0x00860C03U
#define GPIO_70_CANRXA                   0x00860C05U
#define GPIO_70_SCITXDB                  0x00860C06U
#define GPIO_70_MCANRXA                  0x00860C09U
#define GPIO_70_ENET_MII_RX_DV           0x00860C0BU
#define GPIO_70_SD_C4                    0x00860C0DU
#define GPIO_70_ECAT_RX1_DV              0x00860C0EU
#define GPIO_70_SPISOMIC                 0x00860C0FU

#define GPIO_71_GPIO71                   0x00860E00U
#define GPIO_71_EM1D13                   0x00860E02U
#define GPIO_71_EMU1                     0x00860E03U
#define GPIO_71_CANTXA                   0x00860E05U
#define GPIO_71_SCIRXDB                  0x00860E06U
#define GPIO_71_MCANTXA                  0x00860E09U
#define GPIO_71_ENET_MII_RX_DATA0        0x00860E0AU
#define GPIO_71_ENET_MII_RX_ERR          0x00860E0BU
#define GPIO_71_ECAT_RX1_ERR             0x00860E0EU
#define GPIO_71_SPICLKC                  0x00860E0FU

#define GPIO_72_GPIO72                   0x00861000U
#define GPIO_72_EM1D12                   0x00861002U
#define GPIO_72_CANTXB                   0x00861005U
#define GPIO_72_SCITXDC                  0x00861006U
#define GPIO_72_ENET_MII_RX_DATA1        0x0086100AU
#define GPIO_72_ENET_MII_TX_DATA3        0x0086100BU
#define GPIO_72_ECAT_TX1_DATA3           0x0086100EU
#define GPIO_72_SPISTEC                  0x0086100FU

#define GPIO_73_GPIO73                   0x00861200U
#define GPIO_73_EM1D11                   0x00861202U
#define GPIO_73_XCLKOUT                  0x00861203U
#define GPIO_73_CANRXB                   0x00861205U
#define GPIO_73_SCIRXDC                  0x00861206U
#define GPIO_73_ENET_RMII_CLK            0x0086120AU
#define GPIO_73_ENET_MII_TX_DATA2        0x0086120BU
#define GPIO_73_SD_D6                    0x0086120DU
#define GPIO_73_ECAT_TX1_DATA2           0x0086120EU

