maxboss10086/max_dsp/max/F28388D/10_endat_clk/device/driverlib/pin_map.h
#define GPIO_74_GPIO74                   0x00861400U
#define GPIO_74_EM1D10                   0x00861402U
#define GPIO_74_MCANTXA                  0x00861409U
#define GPIO_74_ENET_MII_TX_DATA1        0x0086140BU
#define GPIO_74_SD_C6                    0x0086140DU
#define GPIO_74_ECAT_TX1_DATA1           0x0086140EU

#define GPIO_75_GPIO75                   0x00861600U
#define GPIO_75_EM1D9                    0x00861602U
#define GPIO_75_MCANRXA                  0x00861609U
#define GPIO_75_ENET_MII_TX_DATA0        0x0086160BU
#define GPIO_75_SD_D7                    0x0086160DU
#define GPIO_75_ECAT_TX1_DATA0           0x0086160EU

#define GPIO_76_GPIO76                   0x00861800U
#define GPIO_76_EM1D8                    0x00861802U
#define GPIO_76_SCITXDD                  0x00861806U
#define GPIO_76_ENET_MII_RX_ERR          0x0086180AU
#define GPIO_76_SD_C7                    0x0086180DU
#define GPIO_76_ECAT_PHY_RESETN          0x0086180EU

#define GPIO_77_GPIO77                   0x00861A00U
#define GPIO_77_EM1D7                    0x00861A02U
#define GPIO_77_SCIRXDD                  0x00861A06U
#define GPIO_77_SD_D8                    0x00861A0DU
#define GPIO_77_ECAT_RX0_CLK             0x00861A0EU

#define GPIO_78_GPIO78                   0x00861C00U
#define GPIO_78_EM1D6                    0x00861C02U
#define GPIO_78_EQEP2A                   0x00861C06U
#define GPIO_78_SD_C8                    0x00861C0DU
#define GPIO_78_ECAT_RX0_DV              0x00861C0EU

#define GPIO_79_GPIO79                   0x00861E00U
#define GPIO_79_EM1D5                    0x00861E02U
#define GPIO_79_EQEP2B                   0x00861E06U
#define GPIO_79_SD_D5                    0x00861E0DU
#define GPIO_79_ECAT_RX0_ERR             0x00861E0EU

#define GPIO_80_GPIO80                   0x00880000U
#define GPIO_80_EM1D4                    0x00880002U
#define GPIO_80_EQEP2S                   0x00880006U
#define GPIO_80_SD_C5                    0x0088000DU
#define GPIO_80_ECAT_RX0_DATA0           0x0088000EU

#define GPIO_81_GPIO81                   0x00880200U
#define GPIO_81_EM1D3                    0x00880202U
#define GPIO_81_EQEP2I                   0x00880206U
#define GPIO_81_ECAT_RX0_DATA1           0x0088020EU

#define GPIO_82_GPIO82                   0x00880400U
#define GPIO_82_EM1D2                    0x00880402U
#define GPIO_82_ECAT_RX0_DATA2           0x0088040EU

#define GPIO_83_GPIO83                   0x00880600U
#define GPIO_83_EM1D1                    0x00880602U
#define GPIO_83_ECAT_RX0_DATA3           0x0088060EU

#define GPIO_84_GPIO84                   0x00880800U
#define GPIO_84_SCITXDA                  0x00880805U
#define GPIO_84_MDXB                     0x00880806U
#define GPIO_84_CMUARTTXA                0x0088080BU
#define GPIO_84_ECAT_TX0_ENA             0x0088080EU
#define GPIO_84_MDXA                     0x0088080FU

#define GPIO_85_GPIO85                   0x00880A00U
#define GPIO_85_EM1D0                    0x00880A02U
#define GPIO_85_SCIRXDA                  0x00880A05U
#define GPIO_85_MDRB                     0x00880A06U
#define GPIO_85_CMUARTRXA                0x00880A0BU
#define GPIO_85_ECAT_TX0_CLK             0x00880A0EU
#define GPIO_85_MDRA                     0x00880A0FU

#define GPIO_86_GPIO86                   0x00880C00U
#define GPIO_86_EM1A13                   0x00880C02U
#define GPIO_86_EM1CAS                   0x00880C03U
#define GPIO_86_SCITXDB                  0x00880C05U
#define GPIO_86_MCLKXB                   0x00880C06U
#define GPIO_86_ECAT_PHY0_LINKSTATUS     0x00880C0EU
#define GPIO_86_MCLKXA                   0x00880C0FU

#define GPIO_87_GPIO87                   0x00880E00U
#define GPIO_87_EM1A14                   0x00880E02U
#define GPIO_87_EM1RAS                   0x00880E03U
#define GPIO_87_SCIRXDB                  0x00880E05U
#define GPIO_87_MFSXB                    0x00880E06U
#define GPIO_87_EM1DQM3                  0x00880E09U
#define GPIO_87_ECAT_TX0_DATA0           0x00880E0EU
#define GPIO_87_MFSXA                    0x00880E0FU

#define GPIO_88_GPIO88                   0x00881000U
#define GPIO_88_EM1A15                   0x00881002U
#define GPIO_88_EM1DQM0                  0x00881003U
#define GPIO_88_EM1DQM1                  0x00881009U
#define GPIO_88_ECAT_TX0_DATA1           0x0088100EU

#define GPIO_89_GPIO89                   0x00881200U
#define GPIO_89_EM1A16                   0x00881202U
#define GPIO_89_EM1DQM1                  0x00881203U
#define GPIO_89_SCITXDC                  0x00881206U
#define GPIO_89_EM1CAS                   0x00881209U
#define GPIO_89_ECAT_TX0_DATA2           0x0088120EU

#define GPIO_90_GPIO90                   0x00881400U
#define GPIO_90_EM1A17                   0x00881402U
#define GPIO_90_EM1DQM2                  0x00881403U
#define GPIO_90_SCIRXDC                  0x00881406U
#define GPIO_90_EM1RAS                   0x00881409U
#define GPIO_90_ECAT_TX0_DATA3           0x0088140EU

#define GPIO_91_GPIO91                   0x00881600U
#define GPIO_91_EM1A18                   0x00881602U
#define GPIO_91_EM1DQM3                  0x00881603U
#define GPIO_91_SDAA                     0x00881606U
#define GPIO_91_EM1DQM2                  0x00881609U
#define GPIO_91_PMBCLK                   0x0088160AU
#define GPIO_91_CMSSITXA                 0x0088160BU
#define GPIO_91_FSIRXD0F                 0x0088160DU
#define GPIO_91_SPISIMOD                 0x0088160FU

#define GPIO_92_GPIO92                   0x00881800U
#define GPIO_92_EM1A19                   0x00881802U
#define GPIO_92_EM1BA1                   0x00881803U
#define GPIO_92_SCLA                     0x00881806U
#define GPIO_92_EM1DQM0                  0x00881809U
#define GPIO_92_PMBDAT                   0x0088180AU
#define GPIO_92_CMSSIRXA                 0x0088180BU
#define GPIO_92_FSIRXD1F                 0x0088180DU
#define GPIO_92_SPISOMID                 0x0088180FU

#define GPIO_93_GPIO93                   0x00881A00U
#define GPIO_93_EM1A20                   0x00881A02U
#define GPIO_93_EM1BA0                   0x00881A03U
#define GPIO_93_SCITXDD                  0x00881A06U
#define GPIO_93_PMBALERT                 0x00881A0AU
#define GPIO_93_CMSSICLKA                0x00881A0BU
#define GPIO_93_FSIRXCLKF                0x00881A0DU
#define GPIO_93_SPICLKD                  0x00881A0FU

#define GPIO_94_GPIO94                   0x00881C00U
#define GPIO_94_EM1A21                   0x00881C02U
#define GPIO_94_SCIRXDD                  0x00881C06U
#define GPIO_94_EM1BA1                   0x00881C09U
#define GPIO_94_PMBCTRL                  0x00881C0AU
#define GPIO_94_CMSSIFSSA                0x00881C0BU
#define GPIO_94_FSIRXD0G                 0x00881C0DU
#define GPIO_94_SPISTED                  0x00881C0FU

#define GPIO_95_GPIO95                   0x00881E00U
#define GPIO_95_EM2A12                   0x00881E03U
#define GPIO_95_FSIRXD1G                 0x00881E0DU

#define GPIO_96_GPIO96                   0x00C60000U
#define GPIO_96_EM2DQM1                  0x00C60003U
#define GPIO_96_EQEP1A                   0x00C60005U
#define GPIO_96_FSIRXCLKG                0x00C6000DU

#define GPIO_97_GPIO97                   0x00C60200U
#define GPIO_97_EM2DQM0                  0x00C60203U
#define GPIO_97_EQEP1B                   0x00C60205U
#define GPIO_97_FSIRXD0H                 0x00C6020DU

#define GPIO_98_GPIO98                   0x00C60400U
#define GPIO_98_EM2A0                    0x00C60403U
#define GPIO_98_EQEP1S                   0x00C60405U
#define GPIO_98_FSIRXD1H                 0x00C6040DU

#define GPIO_99_GPIO99                   0x00C60600U
#define GPIO_99_EM2A1                    0x00C60603U
#define GPIO_99_EQEP1I                   0x00C60605U
#define GPIO_99_FSIRXCLKH                0x00C6060DU

