maxboss10086/max_dsp/max/F28388D/10_endat_clk/device/driverlib/pin_map.h
#define GPIO_100_GPIO100                  0x00C60800U
#define GPIO_100_EM2A2                    0x00C60803U
#define GPIO_100_EQEP2A                   0x00C60805U
#define GPIO_100_SPISIMOC                 0x00C60806U
#define GPIO_100_ECAT_GPI0                0x00C6080AU
#define GPIO_100_FSITXD0A                 0x00C6080DU

#define GPIO_101_GPIO101                  0x00C60A00U
#define GPIO_101_EM2A3                    0x00C60A03U
#define GPIO_101_EQEP2B                   0x00C60A05U
#define GPIO_101_SPISOMIC                 0x00C60A06U
#define GPIO_101_ECAT_GPI1                0x00C60A0AU
#define GPIO_101_FSITXD1A                 0x00C60A0DU

#define GPIO_102_GPIO102                  0x00C60C00U
#define GPIO_102_EM2A4                    0x00C60C03U
#define GPIO_102_EQEP2S                   0x00C60C05U
#define GPIO_102_SPICLKC                  0x00C60C06U
#define GPIO_102_ECAT_GPI2                0x00C60C0AU
#define GPIO_102_FSITXCLKA                0x00C60C0DU

#define GPIO_103_GPIO103                  0x00C60E00U
#define GPIO_103_EM2A5                    0x00C60E03U
#define GPIO_103_EQEP2I                   0x00C60E05U
#define GPIO_103_SPISTEC                  0x00C60E06U
#define GPIO_103_ECAT_GPI3                0x00C60E0AU
#define GPIO_103_FSIRXD0A                 0x00C60E0DU

#define GPIO_104_GPIO104                  0x00C61000U
#define GPIO_104_SDAA                     0x00C61001U
#define GPIO_104_EM2A6                    0x00C61003U
#define GPIO_104_EQEP3A                   0x00C61005U
#define GPIO_104_SCITXDD                  0x00C61006U
#define GPIO_104_ECAT_GPI4                0x00C6100AU
#define GPIO_104_CMI2CSDAA                0x00C6100BU
#define GPIO_104_FSIRXD1A                 0x00C6100DU

#define GPIO_105_GPIO105                  0x00C61200U
#define GPIO_105_SCLA                     0x00C61201U
#define GPIO_105_EM2A7                    0x00C61203U
#define GPIO_105_EQEP3B                   0x00C61205U
#define GPIO_105_SCIRXDD                  0x00C61206U
#define GPIO_105_ECAT_GPI5                0x00C6120AU
#define GPIO_105_CMI2CSCLA                0x00C6120BU
#define GPIO_105_FSIRXCLKA                0x00C6120DU
#define GPIO_105_ENET_MDIO_CLK            0x00C6120EU

#define GPIO_106_GPIO106                  0x00C61400U
#define GPIO_106_EM2A8                    0x00C61403U
#define GPIO_106_EQEP3S                   0x00C61405U
#define GPIO_106_SCITXDC                  0x00C61406U
#define GPIO_106_ECAT_GPI6                0x00C6140AU
#define GPIO_106_FSITXD0B                 0x00C6140DU
#define GPIO_106_ENET_MDIO_DATA           0x00C6140EU

#define GPIO_107_GPIO107                  0x00C61600U
#define GPIO_107_EM2A9                    0x00C61603U
#define GPIO_107_EQEP3I                   0x00C61605U
#define GPIO_107_SCIRXDC                  0x00C61606U
#define GPIO_107_ECAT_GPI7                0x00C6160AU
#define GPIO_107_FSITXD1B                 0x00C6160DU
#define GPIO_107_ENET_REVMII_MDIO_RST     0x00C6160EU

#define GPIO_108_GPIO108                  0x00C61800U
#define GPIO_108_EM2A10                   0x00C61803U
#define GPIO_108_ECAT_GPI8                0x00C6180AU
#define GPIO_108_FSITXCLKB                0x00C6180DU
#define GPIO_108_ENET_MII_INTR            0x00C6180EU

#define GPIO_109_GPIO109                  0x00C61A00U
#define GPIO_109_EM2A11                   0x00C61A03U
#define GPIO_109_ECAT_GPI9                0x00C61A0AU
#define GPIO_109_ENET_MII_CRS             0x00C61A0EU

#define GPIO_110_GPIO110                  0x00C61C00U
#define GPIO_110_EM2WAIT0                 0x00C61C03U
#define GPIO_110_ECAT_GPI10               0x00C61C0AU
#define GPIO_110_FSIRXD0B                 0x00C61C0DU
#define GPIO_110_ENET_MII_COL             0x00C61C0EU

#define GPIO_111_GPIO111                  0x00C61E00U
#define GPIO_111_EM2BA0                   0x00C61E03U
#define GPIO_111_ECAT_GPI11               0x00C61E0AU
#define GPIO_111_FSIRXD1B                 0x00C61E0DU
#define GPIO_111_ENET_MII_RX_CLK          0x00C61E0EU

#define GPIO_112_GPIO112                  0x00C80000U
#define GPIO_112_EM2BA1                   0x00C80003U
#define GPIO_112_ECAT_GPI12               0x00C8000AU
#define GPIO_112_FSIRXCLKB                0x00C8000DU
#define GPIO_112_ENET_MII_RX_DV           0x00C8000EU

#define GPIO_113_GPIO113                  0x00C80200U
#define GPIO_113_EM2CAS                   0x00C80203U
#define GPIO_113_ECAT_GPI13               0x00C8020AU
#define GPIO_113_ENET_MII_RX_ERR          0x00C8020EU

#define GPIO_114_GPIO114                  0x00C80400U
#define GPIO_114_EM2RAS                   0x00C80403U
#define GPIO_114_ECAT_GPI14               0x00C8040AU
#define GPIO_114_ENET_MII_RX_DATA0        0x00C8040EU

#define GPIO_115_GPIO115                  0x00C80600U
#define GPIO_115_EM2CS0N                  0x00C80603U
#define GPIO_115_OUTPUTXBAR5              0x00C80605U
#define GPIO_115_ECAT_GPI15               0x00C8060AU
#define GPIO_115_FSIRXD0C                 0x00C8060DU
#define GPIO_115_ENET_MII_RX_DATA1        0x00C8060EU

#define GPIO_116_GPIO116                  0x00C80800U
#define GPIO_116_EM2CS2N                  0x00C80803U
#define GPIO_116_OUTPUTXBAR6              0x00C80805U
#define GPIO_116_ECAT_GPI16               0x00C8080AU
#define GPIO_116_FSIRXD1C                 0x00C8080DU
#define GPIO_116_ENET_MII_RX_DATA2        0x00C8080EU

#define GPIO_117_GPIO117                  0x00C80A00U
#define GPIO_117_EM2SDCKE                 0x00C80A03U
#define GPIO_117_ECAT_GPI17               0x00C80A0AU
#define GPIO_117_FSIRXCLKC                0x00C80A0DU
#define GPIO_117_ENET_MII_RX_DATA3        0x00C80A0EU

#define GPIO_118_GPIO118                  0x00C80C00U
#define GPIO_118_EM2CLK                   0x00C80C03U
#define GPIO_118_ECAT_GPI18               0x00C80C0AU
#define GPIO_118_FSIRXD0D                 0x00C80C0DU
#define GPIO_118_ENET_MII_TX_EN           0x00C80C0EU

#define GPIO_119_GPIO119                  0x00C80E00U
#define GPIO_119_EM2RNW                   0x00C80E03U
#define GPIO_119_ECAT_GPI19               0x00C80E0AU
#define GPIO_119_FSIRXD1D                 0x00C80E0DU
#define GPIO_119_ENET_MII_TX_ERR          0x00C80E0EU

#define GPIO_120_GPIO120                  0x00C81000U
#define GPIO_120_EM2WEN                   0x00C81003U
#define GPIO_120_ECAT_GPI20               0x00C8100AU
#define GPIO_120_FSIRXCLKD                0x00C8100DU
#define GPIO_120_ENET_MII_TX_CLK          0x00C8100EU
#define GPIO_120_USB0PFLT                 0x00C8100FU

#define GPIO_121_GPIO121                  0x00C81200U
#define GPIO_121_EM2OEN                   0x00C81203U
#define GPIO_121_ECAT_GPI21               0x00C8120AU
#define GPIO_121_FSIRXD0E                 0x00C8120DU
#define GPIO_121_ENET_MII_TX_DATA0        0x00C8120EU
#define GPIO_121_USB0EPEN                 0x00C8120FU

#define GPIO_122_GPIO122                  0x00C81400U
#define GPIO_122_EM2D15                   0x00C81403U
#define GPIO_122_SPISIMOC                 0x00C81406U
#define GPIO_122_SD_D1                    0x00C81407U
#define GPIO_122_ECAT_GPI22               0x00C8140AU
#define GPIO_122_ENET_MII_TX_DATA1        0x00C8140EU
#define GPIO_122_ODISCHRGVBUS             0x00C8140FU

