maxboss10086/max_dsp/max/F28388D/10_endat_clk/device/driverlib/pin_map.h
#define GPIO_123_GPIO123                  0x00C81600U
#define GPIO_123_EM2D14                   0x00C81603U
#define GPIO_123_SPISOMIC                 0x00C81606U
#define GPIO_123_SD_C1                    0x00C81607U
#define GPIO_123_ECAT_GPI23               0x00C8160AU
#define GPIO_123_ENET_MII_TX_DATA2        0x00C8160EU
#define GPIO_123_OCHRGVBUS                0x00C8160FU

#define GPIO_124_GPIO124                  0x00C81800U
#define GPIO_124_EM2D13                   0x00C81803U
#define GPIO_124_SPICLKC                  0x00C81806U
#define GPIO_124_SD_D2                    0x00C81807U
#define GPIO_124_ECAT_GPI24               0x00C8180AU
#define GPIO_124_ENET_MII_TX_DATA3        0x00C8180EU
#define GPIO_124_ODMPULLDN                0x00C8180FU

#define GPIO_125_GPIO125                  0x00C81A00U
#define GPIO_125_EM2D12                   0x00C81A03U
#define GPIO_125_SPISTEC                  0x00C81A06U
#define GPIO_125_SD_C2                    0x00C81A07U
#define GPIO_125_ECAT_GPI25               0x00C81A0AU
#define GPIO_125_FSIRXD1E                 0x00C81A0DU
#define GPIO_125_ECAT_LATCH0              0x00C81A0EU
#define GPIO_125_ODPPULLDN                0x00C81A0FU

#define GPIO_126_GPIO126                  0x00C81C00U
#define GPIO_126_EM2D11                   0x00C81C03U
#define GPIO_126_SD_D3                    0x00C81C07U
#define GPIO_126_ECAT_GPI26               0x00C81C0AU
#define GPIO_126_FSIRXCLKE                0x00C81C0DU
#define GPIO_126_ECAT_LATCH1              0x00C81C0EU
#define GPIO_126_OLSD_2_N                 0x00C81C0FU

#define GPIO_127_GPIO127                  0x00C81E00U
#define GPIO_127_EM2D10                   0x00C81E03U
#define GPIO_127_SD_C3                    0x00C81E07U
#define GPIO_127_ECAT_GPI27               0x00C81E0AU
#define GPIO_127_ECAT_SYNC0               0x00C81E0EU
#define GPIO_127_OLSD_1_N                 0x00C81E0FU

#define GPIO_128_GPIO128                  0x01060000U
#define GPIO_128_EM2D9                    0x01060003U
#define GPIO_128_SD_D4                    0x01060007U
#define GPIO_128_ECAT_GPI28               0x0106000AU
#define GPIO_128_ECAT_SYNC1               0x0106000EU
#define GPIO_128_OIDPULLUP                0x0106000FU

#define GPIO_129_GPIO129                  0x01060200U
#define GPIO_129_EM2D8                    0x01060203U
#define GPIO_129_SD_C4                    0x01060207U
#define GPIO_129_ECAT_GPI29               0x0106020AU
#define GPIO_129_ECAT_TX1_ENA             0x0106020EU
#define GPIO_129_OSPEED                   0x0106020FU

#define GPIO_130_GPIO130                  0x01060400U
#define GPIO_130_EM2D7                    0x01060403U
#define GPIO_130_SD_D5                    0x01060407U
#define GPIO_130_ECAT_GPI30               0x0106040AU
#define GPIO_130_ECAT_TX1_CLK             0x0106040EU
#define GPIO_130_OSUSPEND                 0x0106040FU

#define GPIO_131_GPIO131                  0x01060600U
#define GPIO_131_EM2D6                    0x01060603U
#define GPIO_131_SD_C5                    0x01060607U
#define GPIO_131_ECAT_GPI31               0x0106060AU
#define GPIO_131_ECAT_TX1_DATA0           0x0106060EU
#define GPIO_131_OOE                      0x0106060FU

#define GPIO_132_GPIO132                  0x01060800U
#define GPIO_132_EM2D5                    0x01060803U
#define GPIO_132_SD_D6                    0x01060807U
#define GPIO_132_ECAT_GPO0                0x0106080AU
#define GPIO_132_ECAT_TX1_DATA1           0x0106080EU
#define GPIO_132_ODMSE0                   0x0106080FU

#define GPIO_133_GPIO133                  0x01060A00U
#define GPIO_133_SD_C6                    0x01060A07U
#define GPIO_133_ODPDAT                   0x01060A0FU

#define GPIO_134_GPIO134                  0x01060C00U
#define GPIO_134_EM2D4                    0x01060C03U
#define GPIO_134_SD_D7                    0x01060C07U
#define GPIO_134_ECAT_GPO1                0x01060C0AU
#define GPIO_134_ECAT_TX1_DATA2           0x01060C0EU
#define GPIO_134_IVBUSVALID               0x01060C0FU

#define GPIO_135_GPIO135                  0x01060E00U
#define GPIO_135_EM2D3                    0x01060E03U
#define GPIO_135_SCITXDA                  0x01060E06U
#define GPIO_135_SD_C7                    0x01060E07U
#define GPIO_135_ECAT_GPO2                0x01060E0AU
#define GPIO_135_ECAT_TX1_DATA3           0x01060E0EU

#define GPIO_136_GPIO136                  0x01061000U
#define GPIO_136_EM2D2                    0x01061003U
#define GPIO_136_SCIRXDA                  0x01061006U
#define GPIO_136_SD_D8                    0x01061007U
#define GPIO_136_ECAT_GPO3                0x0106100AU
#define GPIO_136_ECAT_RX1_DV              0x0106100EU

#define GPIO_137_GPIO137                  0x01061200U
#define GPIO_137_EPWM13A                  0x01061201U
#define GPIO_137_EM2D1                    0x01061203U
#define GPIO_137_SCITXDB                  0x01061206U
#define GPIO_137_SD_C8                    0x01061207U
#define GPIO_137_ECAT_GPO4                0x0106120AU
#define GPIO_137_ECAT_RX1_CLK             0x0106120EU

#define GPIO_138_GPIO138                  0x01061400U
#define GPIO_138_EPWM13B                  0x01061401U
#define GPIO_138_EM2D0                    0x01061403U
#define GPIO_138_SCIRXDB                  0x01061406U
#define GPIO_138_ECAT_GPO5                0x0106140AU
#define GPIO_138_ECAT_RX1_ERR             0x0106140EU

#define GPIO_139_GPIO139                  0x01061600U
#define GPIO_139_EPWM14A                  0x01061601U
#define GPIO_139_SCIRXDC                  0x01061606U
#define GPIO_139_ECAT_GPO6                0x0106160AU
#define GPIO_139_ECAT_RX1_DATA0           0x0106160EU

#define GPIO_140_GPIO140                  0x01061800U
#define GPIO_140_EPWM14B                  0x01061801U
#define GPIO_140_SCITXDC                  0x01061806U
#define GPIO_140_ECAT_GPO7                0x0106180AU
#define GPIO_140_ECAT_RX1_DATA1           0x0106180EU

#define GPIO_141_GPIO141                  0x01061A00U
#define GPIO_141_EPWM15A                  0x01061A01U
#define GPIO_141_SCIRXDD                  0x01061A06U
#define GPIO_141_ECAT_GPO8                0x01061A0AU
#define GPIO_141_ECAT_RX1_DATA2           0x01061A0EU

#define GPIO_142_GPIO142                  0x01061C00U
#define GPIO_142_EPWM15B                  0x01061C01U
#define GPIO_142_SCITXDD                  0x01061C06U
#define GPIO_142_ECAT_GPO9                0x01061C0AU
#define GPIO_142_ECAT_RX1_DATA3           0x01061C0EU

#define GPIO_143_GPIO143                  0x01061E00U
#define GPIO_143_EPWM16A                  0x01061E01U
#define GPIO_143_ECAT_GPO10               0x01061E0AU
#define GPIO_143_ECAT_LED_LINK0_ACTIVE    0x01061E0EU

#define GPIO_144_GPIO144                  0x01080000U
#define GPIO_144_EPWM16B                  0x01080001U
#define GPIO_144_ECAT_GPO11               0x0108000AU
#define GPIO_144_ECAT_LED_LINK1_ACTIVE    0x0108000EU

