maxboss10086/max_dsp/max/F28388D/10_endat_clk/device/driverlib/pin_map.h
#define GPIO_145_GPIO145                  0x01080200U
#define GPIO_145_EPWM1A                   0x01080201U
#define GPIO_145_ECAT_GPO12               0x0108020AU
#define GPIO_145_ECAT_LED_ERR             0x0108020EU

#define GPIO_146_GPIO146                  0x01080400U
#define GPIO_146_EPWM1B                   0x01080401U
#define GPIO_146_ECAT_GPO13               0x0108040AU
#define GPIO_146_ECAT_LED_RUN             0x0108040EU

#define GPIO_147_GPIO147                  0x01080600U
#define GPIO_147_EPWM2A                   0x01080601U
#define GPIO_147_ECAT_GPO14               0x0108060AU
#define GPIO_147_ECAT_LED_STATE_RUN       0x0108060EU

#define GPIO_148_GPIO148                  0x01080800U
#define GPIO_148_EPWM2B                   0x01080801U
#define GPIO_148_ECAT_GPO15               0x0108080AU
#define GPIO_148_ECAT_PHY0_LINKSTATUS     0x0108080EU

#define GPIO_149_GPIO149                  0x01080A00U
#define GPIO_149_EPWM3A                   0x01080A01U
#define GPIO_149_ECAT_GPO16               0x01080A0AU
#define GPIO_149_ECAT_PHY1_LINKSTATUS     0x01080A0EU

#define GPIO_150_GPIO150                  0x01080C00U
#define GPIO_150_EPWM3B                   0x01080C01U
#define GPIO_150_ECAT_GPO17               0x01080C0AU
#define GPIO_150_ECAT_I2C_SDA             0x01080C0EU

#define GPIO_151_GPIO151                  0x01080E00U
#define GPIO_151_EPWM4A                   0x01080E01U
#define GPIO_151_ECAT_GPO18               0x01080E0AU
#define GPIO_151_ECAT_I2C_SCL             0x01080E0EU

#define GPIO_152_GPIO152                  0x01081000U
#define GPIO_152_EPWM4B                   0x01081001U
#define GPIO_152_ECAT_GPO19               0x0108100AU
#define GPIO_152_ECAT_MDIO_CLK            0x0108100EU

#define GPIO_153_GPIO153                  0x01081200U
#define GPIO_153_EPWM5A                   0x01081201U
#define GPIO_153_ECAT_GPO20               0x0108120AU
#define GPIO_153_ECAT_MDIO_DATA           0x0108120EU

#define GPIO_154_GPIO154                  0x01081400U
#define GPIO_154_EPWM5B                   0x01081401U
#define GPIO_154_ECAT_GPO21               0x0108140AU
#define GPIO_154_ECAT_PHY_CLK             0x0108140EU

#define GPIO_155_GPIO155                  0x01081600U
#define GPIO_155_EPWM6A                   0x01081601U
#define GPIO_155_ECAT_GPO22               0x0108160AU
#define GPIO_155_ECAT_PHY_RESETN          0x0108160EU

#define GPIO_156_GPIO156                  0x01081800U
#define GPIO_156_EPWM6B                   0x01081801U
#define GPIO_156_ECAT_GPO23               0x0108180AU
#define GPIO_156_ECAT_TX0_ENA             0x0108180EU

#define GPIO_157_GPIO157                  0x01081A00U
#define GPIO_157_EPWM7A                   0x01081A01U
#define GPIO_157_ECAT_GPO24               0x01081A0AU
#define GPIO_157_ECAT_TX0_CLK             0x01081A0EU

#define GPIO_158_GPIO158                  0x01081C00U
#define GPIO_158_EPWM7B                   0x01081C01U
#define GPIO_158_ECAT_GPO25               0x01081C0AU
#define GPIO_158_ECAT_TX0_DATA0           0x01081C0EU

#define GPIO_159_GPIO159                  0x01081E00U
#define GPIO_159_EPWM8A                   0x01081E01U
#define GPIO_159_ECAT_GPO26               0x01081E0AU
#define GPIO_159_ECAT_TX0_DATA1           0x01081E0EU

#define GPIO_160_GPIO160                  0x01460000U
#define GPIO_160_EPWM8B                   0x01460001U
#define GPIO_160_ECAT_GPO27               0x0146000AU
#define GPIO_160_ECAT_TX0_DATA2           0x0146000EU

#define GPIO_161_GPIO161                  0x01460200U
#define GPIO_161_EPWM9A                   0x01460201U
#define GPIO_161_ECAT_GPO28               0x0146020AU
#define GPIO_161_ECAT_TX0_DATA3           0x0146020EU

#define GPIO_162_GPIO162                  0x01460400U
#define GPIO_162_EPWM9B                   0x01460401U
#define GPIO_162_ECAT_GPO29               0x0146040AU
#define GPIO_162_ECAT_RX0_DV              0x0146040EU

#define GPIO_163_GPIO163                  0x01460600U
#define GPIO_163_EPWM10A                  0x01460601U
#define GPIO_163_ECAT_GPO30               0x0146060AU
#define GPIO_163_ECAT_RX0_CLK             0x0146060EU

#define GPIO_164_GPIO164                  0x01460800U
#define GPIO_164_EPWM10B                  0x01460801U
#define GPIO_164_ECAT_GPO31               0x0146080AU
#define GPIO_164_ECAT_RX0_ERR             0x0146080EU

#define GPIO_165_GPIO165                  0x01460A00U
#define GPIO_165_EPWM11A                  0x01460A01U
#define GPIO_165_MDXA                     0x01460A0AU
#define GPIO_165_ECAT_RX0_DATA0           0x01460A0EU

#define GPIO_166_GPIO166                  0x01460C00U
#define GPIO_166_EPWM11B                  0x01460C01U
#define GPIO_166_MDRA                     0x01460C0AU
#define GPIO_166_ECAT_RX0_DATA1           0x01460C0EU

#define GPIO_167_GPIO167                  0x01460E00U
#define GPIO_167_EPWM12A                  0x01460E01U
#define GPIO_167_MCLKXA                   0x01460E0AU
#define GPIO_167_ECAT_RX0_DATA2           0x01460E0EU

#define GPIO_168_GPIO168                  0x01461000U
#define GPIO_168_EPWM12B                  0x01461001U
#define GPIO_168_MFSXA                    0x0146100AU
#define GPIO_168_ECAT_RX0_DATA3           0x0146100EU

#endif // __PIN_MAP_H__
